sample/12/swarm-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t4-c512-d30-R1000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1000
Running 30s test @ http://10.10.1.7:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 2.099ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.151ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.154ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.052ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.08ms    1.32ms   6.39ms   81.37%
    Req/Sec   263.58    164.34   700.00     74.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.58ms
 75.000%    2.77ms
 90.000%    4.01ms
 99.000%    6.39ms
 99.900%    7.96ms
 99.990%    9.63ms
 99.999%   13.22ms
100.000%   13.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.342     0.000000            1         1.00
       0.864     0.100000         2002         1.11
       1.014     0.200000         3978         1.25
       1.340     0.300000         5976         1.43
       1.464     0.400000         7950         1.67
       1.576     0.500000         9945         2.00
       1.648     0.550000        10931         2.22
       1.751     0.600000        11929         2.50
       1.935     0.650000        12922         2.86
       2.415     0.700000        13913         3.33
       2.771     0.750000        14907         4.00
       2.935     0.775000        15405         4.44
       3.115     0.800000        15906         5.00
       3.289     0.825000        16399         5.71
       3.491     0.850000        16905         6.67
       3.719     0.875000        17397         8.00
       3.847     0.887500        17639         8.89
       4.009     0.900000        17889        10.00
       4.183     0.912500        18143        11.43
       4.359     0.925000        18388        13.33
       4.583     0.937500        18637        16.00
       4.703     0.943750        18758        17.78
       4.807     0.950000        18882        20.00
       4.947     0.956250        19007        22.86
       5.123     0.962500        19129        26.67
       5.351     0.968750        19254        32.00
       5.479     0.971875        19319        35.56
       5.579     0.975000        19381        40.00
       5.707     0.978125        19440        45.71
       5.851     0.981250        19502        53.33
       6.007     0.984375        19566        64.00
       6.119     0.985938        19596        71.11
       6.203     0.987500        19626        80.00
       6.315     0.989062        19659        91.43
       6.423     0.990625        19690       106.67
       6.547     0.992188        19719       128.00
       6.635     0.992969        19735       142.22
       6.703     0.993750        19750       160.00
       6.795     0.994531        19766       182.86
       6.831     0.995313        19782       213.33
       7.023     0.996094        19797       256.00
       7.147     0.996484        19805       284.44
       7.235     0.996875        19813       320.00
       7.319     0.997266        19820       365.71
       7.427     0.997656        19828       426.67
       7.555     0.998047        19836       512.00
       7.591     0.998242        19840       568.89
       7.671     0.998437        19843       640.00
       7.743     0.998633        19847       731.43
       7.855     0.998828        19851       853.33
       8.031     0.999023        19855      1024.00
       8.271     0.999121        19857      1137.78
       8.367     0.999219        19859      1280.00
       8.495     0.999316        19861      1462.86
       8.631     0.999414        19863      1706.67
       8.711     0.999512        19865      2048.00
       8.759     0.999561        19866      2275.56
       8.807     0.999609        19868      2560.00
       8.807     0.999658        19868      2925.71
       8.967     0.999707        19869      3413.33
       9.063     0.999756        19870      4096.00
       9.063     0.999780        19870      4551.11
       9.623     0.999805        19871      5120.00
       9.623     0.999829        19871      5851.43
       9.631     0.999854        19872      6826.67
       9.631     0.999878        19872      8192.00
       9.631     0.999890        19872      9102.22
       9.951     0.999902        19873     10240.00
       9.951     0.999915        19873     11702.86
       9.951     0.999927        19873     13653.33
       9.951     0.999939        19873     16384.00
       9.951     0.999945        19873     18204.44
      13.215     0.999951        19874     20480.00
      13.215     1.000000        19874          inf
#[Mean    =        2.083, StdDeviation   =        1.316]
#[Max     =       13.208, Total count    =        19874]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29634 requests in 30.00s, 12.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 148
Requests/sec:    987.74
Transfer/sec:    419.07KB