sample/12/swarm-mm-wrk-compose-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t4-c512-d30-R1000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1000
Running 30s test @ http://10.10.1.5:8080/wrk2-api/user-timeline/read
  4 threads and 512 connections
  Thread calibration: mean lat.: 3414.859ms, rate sampling interval: 12648ms
  Thread calibration: mean lat.: 3246.590ms, rate sampling interval: 11894ms
  Thread calibration: mean lat.: 3362.262ms, rate sampling interval: 12582ms
  Thread calibration: mean lat.: 3421.013ms, rate sampling interval: 12771ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.88s     4.12s   21.64s    62.69%
    Req/Sec    88.00      0.00    88.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.75s 
 75.000%   16.08s 
 90.000%   18.50s 
 99.000%   21.64s 
 99.900%   23.48s 
 99.990%   24.54s 
 99.999%   24.81s 
100.000%   24.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2301.951     0.000000            1         1.00
    7577.599     0.100000          705         1.11
    8929.279     0.200000         1409         1.25
   10166.271     0.300000         2112         1.43
   11419.647     0.400000         2817         1.67
   12754.943     0.500000         3519         2.00
   13385.727     0.550000         3870         2.22
   14041.087     0.600000         4221         2.50
   14737.407     0.650000         4575         2.86
   15376.383     0.700000         4927         3.33
   16080.895     0.750000         5277         4.00
   16416.767     0.775000         5454         4.44
   16793.599     0.800000         5627         5.00
   17186.815     0.825000         5805         5.71
   17547.263     0.850000         5979         6.67
   18006.015     0.875000         6161         8.00
   18235.391     0.887500         6245         8.89
   18497.535     0.900000         6330        10.00
   18792.447     0.912500         6419        11.43
   19087.359     0.925000         6511        13.33
   19398.655     0.937500         6599        16.00
   19546.111     0.943750         6638        17.78
   19742.719     0.950000         6683        20.00
   19955.711     0.956250         6733        22.86
   20168.703     0.962500         6773        26.67
   20430.847     0.968750         6816        32.00
   20545.535     0.971875         6836        35.56
   20709.375     0.975000         6859        40.00
   20840.447     0.978125         6881        45.71
   21037.055     0.981250         6904        53.33
   21250.047     0.984375         6927        64.00
   21315.583     0.985938         6935        71.11
   21430.271     0.987500         6946        80.00
   21577.727     0.989062         6957        91.43
   21692.415     0.990625         6968       106.67
   21987.327     0.992188         6979       128.00
   22069.247     0.992969         6985       142.22
   22134.783     0.993750         6991       160.00
   22265.855     0.994531         6995       182.86
   22396.927     0.995313         7003       213.33
   22577.151     0.996094         7007       256.00
   22642.687     0.996484         7011       284.44
   22708.223     0.996875         7012       320.00
   22806.527     0.997266         7015       365.71
   22855.679     0.997656         7017       426.67
   23052.287     0.998047         7020       512.00
   23101.439     0.998242         7021       568.89
   23265.279     0.998437         7023       640.00
   23281.663     0.998633         7024       731.43
   23347.199     0.998828         7025       853.33
   23511.039     0.999023         7027      1024.00
   23511.039     0.999121         7027      1137.78
   23658.495     0.999219         7029      1280.00
   23658.495     0.999316         7029      1462.86
   23658.495     0.999414         7029      1706.67
   24084.479     0.999512         7030      2048.00
   24084.479     0.999561         7030      2275.56
   24133.631     0.999609         7031      2560.00
   24133.631     0.999658         7031      2925.71
   24133.631     0.999707         7031      3413.33
   24543.231     0.999756         7032      4096.00
   24543.231     0.999780         7032      4551.11
   24543.231     0.999805         7032      5120.00
   24543.231     0.999829         7032      5851.43
   24543.231     0.999854         7032      6826.67
   24805.375     0.999878         7033      8192.00
   24805.375     1.000000         7033          inf
#[Mean    =    12884.337, StdDeviation   =     4122.938]
#[Max     =    24788.992, Total count    =         7033]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10356 requests in 30.03s, 2.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 133
  Non-2xx or 3xx responses: 1817
Requests/sec:    344.89
Transfer/sec:     72.20KB